tests/ThermophysicalTransportModels/mouldHTC/case/Allrun
#!/bin/bash

# Source tutorial run functions
source $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

# Compile
wmake ..

# Mesh
runApplication blockMesh

# Run
runApplication ./test_mouldHTC --log_level=all

#------------------------------------------------------------------------------
